const madeByAleshEmojis = [
  "🤠","🥳","🥸","😱","💀","💩","🤡","👹","👺","👻","👽","👾","🤖","🙈","🙉","🙊",
  "💗","💔","❤️‍🔥","❤️‍🩹","❤️","💋","💥","💨","🕳️","💬","💤","🖖","✌️","🤞","🤟","🤘",
  "🖕","🫵","👊","🙌","🫶","💅","🦾","🫀","🙋‍♂️","🤦‍♂️","🤷‍♂️","🧑‍🎨","🕵️","🧚","🧞‍♂️","🧟‍♂️",
  "💃","🏄","🛌","🐶","🐈","🦄","🦙","🦇","🦥","🕊️","🦅","🦩","🦚","🐲","🐉","🐳","🐋",
  "🐙","🐚","🪸","🐞","🕷️","🦠","💐","🌻","🌲","🌴","🌾","🍄","🍋","🍎","🍑","🍒","🥝",
  "🍅","🫒","🥑","🍆","🌶️","🥯","🧀","🍕","🌮","🍳","🍝","🍣","🥟","🍩","🍪","🍮","☕",
  "🍺","🏔️","🏖️","🏥","🏭","🗽","🛝","🚂","🚨","🛟","🪂","🛎️","🪐","❄️","🌊","🔫","🎱",
  "🔮","🎰","🎲","🪩","🥽","🛍️","🩴","👑","🎩","💄","🥁","💰","✂️","🛠️","💣","🪃","🪚",
  "🪜","⚗️","🩸","💊","🛁","🪤","🧻","🧯","🧿","🗿","🏳️‍🌈","🏴‍☠️"
];

class MadeByAlesh extends HTMLElement {
  connectedCallback() {
    if (this.dataset.ready === "true") {
      return;
    }

    const randomIndex = Math.floor(Math.random() * madeByAleshEmojis.length);
    const emoji = madeByAleshEmojis[randomIndex];

    this.innerHTML = `Made with <span class="footer-emoji" aria-hidden="true">${emoji}</span> by <a href="https://alesh.com">Alesh</a>.`;
    this.dataset.ready = "true";
  }
}

customElements.define("made-by-alesh", MadeByAlesh);
